---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryXY
enum: Autodesk.Revit.DB.IFC.IFCExtrusionAxes
source: html/ec83b366-85d1-3e3f-edc6-6cffd36848e6.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryXY

The x- and y-axes.